# Combining Series and Dataframe

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pld
import seaborn as sns

## Combining Series

In [2]:
# First we make two series, then combine/concatenate it.
# It basically stacks one on top of another.
s1 = pd.Series(["a","b","c","d","e"])
s2 = pd.Series(["f","g","h","i","j"])

In [3]:
s1

0    a
1    b
2    c
3    d
4    e
dtype: object

In [4]:
s2

0    f
1    g
2    h
3    i
4    j
dtype: object

In [5]:
pd.concat([s1,s2])

0    a
1    b
2    c
3    d
4    e
0    f
1    g
2    h
3    i
4    j
dtype: object

In [6]:
# To make index not repeat and stay continuous use .ignore_index=True
pd.concat([s1,s2],ignore_index=True)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

In [7]:
# We can also concate num series with text series
num1 = pd.Series([54,64,34,54,33])
pd.concat([num1,s2],ignore_index=True)

0    54
1    64
2    34
3    54
4    33
5     f
6     g
7     h
8     i
9     j
dtype: object

## Concatenating series by Index:

In [10]:
# We will define series with custom index, and we'll concatenate both series
# This time we'll concatenate it as dataframe instead of stacking one on top of another
# How? by changing the axis to 1, default: axis=0

In [8]:
fruits = pd.Series(
            data = ["Apple", "Guava", "Banana"],
            index = ["a","b","c"]
    )

animals = pd.Series(
            data = ["Giraffe","Dog","Cat"],
            index = ["c","b","a"]
    )

In [9]:
fruits

a     Apple
b     Guava
c    Banana
dtype: object

In [10]:
animals

c    Giraffe
b        Dog
a        Cat
dtype: object

In [11]:
pd.concat([fruits,animals])
# This is a concatenated series.

a      Apple
b      Guava
c     Banana
c    Giraffe
b        Dog
a        Cat
dtype: object

In [12]:
# Now, to concatenate series side by side as dataframe.
# We just change the axis to 1
pd.concat([fruits,animals],axis=1)
# Two series concatenates with same index data

        0        1
a   Apple      Cat
b   Guava      Dog
c  Banana  Giraffe

In [13]:
# We can provide keys too, keys are just headers.
pd.concat([fruits,animals],axis=1,keys=["fruits","animals"])

   fruits  animals
a   Apple      Cat
b   Guava      Dog
c  Banana  Giraffe

## Inner Joins and Outer Joins

In [ ]:
# Till now we concatenated two series with same index
# Now, we'll concatenate two series with same index that exist on one,
# but, is not on other
# and, one series having more data than the other

In [14]:
fruits = pd.Series(
            data=["Apple","Papaya","Banana","Orange"],
            index=["a","b","c","d"]
    )
animals = pd.Series(
            data=["pegion","tiger","donkey","pitbull","crow"],
            index=["c","b","a","e","l"]
    )

In [15]:
animals

c     pegion
b      tiger
a     donkey
e    pitbull
l       crow
dtype: object

In [16]:
fruits

a     Apple
b    Papaya
c    Banana
d    Orange
dtype: object

In [ ]:
# e,l index do not exist in fruits series.
# d index do not exist in animals series.

In [17]:
pd.concat([fruits,animals])

a      Apple
b     Papaya
c     Banana
d     Orange
c     pegion
b      tiger
a     donkey
e    pitbull
l       crow
dtype: object

In [18]:
# Now we concatenate as dataframes
pd.concat([fruits,animals],axis=1)
# By default, pandas perform an outer join
# Outer join prints all data, and puts NaN in place of empty values

        0        1
a   Apple   donkey
b  Papaya    tiger
c  Banana   pegion
d  Orange      NaN
e     NaN  pitbull
l     NaN     crow

In [19]:
# But, in case of inner join, it only includes data that have overlapping index.
pd.concat([fruits,animals],join="inner",axis=1)

        0       1
a   Apple  donkey
b  Papaya   tiger
c  Banana  pegion

## Concatenating Dataframes by Columns

In [20]:
sales_2021 = pd.DataFrame(
        [["Pan",2000],["Massager",1540],["Reliner",2100]],
        columns=["Product","Quantity"]
        )

sales_2022 = pd.DataFrame(
        [["Pencil",3500],["Bicycle",1523],["Armchair",859]],
        columns=["Product","Quantity"]
        )

In [21]:
pd.concat([sales_2021,sales_2022],ignore_index=True)

    Product  Quantity
0       Pan      2000
1  Massager      1540
2   Reliner      2100
3    Pencil      3500
4   Bicycle      1523
5  Armchair       859

In [22]:
# Now, we create a new column 'profit' only on the new dataframe
sales_2023 = pd.DataFrame(
        [["Crocin",300,1500],["Knife",533,1242],["Vegetable Cutter",3344,2122]],
        columns=["Product","Quantity","Profit"]
        )

In [23]:
pd.concat([sales_2021,sales_2022,sales_2023],ignore_index=True)
# By default, pandas does outer join

            Product  Quantity  Profit
0               Pan      2000     NaN
1          Massager      1540     NaN
2           Reliner      2100     NaN
3            Pencil      3500     NaN
4           Bicycle      1523     NaN
5          Armchair       859     NaN
6            Crocin       300  1500.0
7             Knife       533  1242.0
8  Vegetable Cutter      3344  2122.0

In [24]:
pd.concat([sales_2021,sales_2022,sales_2023],join="inner",ignore_index=True)
# When we 'inner join', profit column is removed

            Product  Quantity
0               Pan      2000
1          Massager      1540
2           Reliner      2100
3            Pencil      3500
4           Bicycle      1523
5          Armchair       859
6            Crocin       300
7             Knife       533
8  Vegetable Cutter      3344

## Concatenating DataFrames by index

In [29]:
livestock = pd.DataFrame(
                [["Barn",10],["Stable",21],["Coop",120]],
                columns = ["location","Qty"],
                index=["Cow","Horse","Chicken"]
            )

weights = pd.DataFrame(
                [[4,9],[90,134],[8,27],[4,24]],
                columns=["min_weight","max_weight"],
                index=["Chicken","Horse","Duck","Cow"]
            )

In [30]:
livestock

        location  Qty
Cow         Barn   10
Horse     Stable   21
Chicken     Coop  120

In [31]:
weights

         min_weight  max_weight
Chicken           4           9
Horse            90         134
Duck              8          27
Cow               4          24

In [33]:
pd.concat([livestock,weights])
# This dataframe is joined on axis=0 and outer-join

        location    Qty  min_weight  max_weight
Cow         Barn   10.0         NaN         NaN
Horse     Stable   21.0         NaN         NaN
Chicken     Coop  120.0         NaN         NaN
Chicken      NaN    NaN         4.0         9.0
Horse        NaN    NaN        90.0       134.0
Duck         NaN    NaN         8.0        27.0
Cow          NaN    NaN         4.0        24.0

In [35]:
pd.concat([livestock,weights],axis=1)

        location    Qty  min_weight  max_weight
Cow         Barn   10.0           4          24
Horse     Stable   21.0          90         134
Chicken     Coop  120.0           4           9
Duck         NaN    NaN           8          27

In [36]:
# inner join removes the last row
pd.concat([livestock,weights],axis=1,join="inner")

        location  Qty  min_weight  max_weight
Cow         Barn   10           4          24
Horse     Stable   21          90         134
Chicken     Coop  120           4           9

## Dataframe merge()
    Syntax: df1.merge(df2)
    This merges two dataframes using common columns.

In [39]:
teams = pd.DataFrame(
            [
                ["Chennai Super Kings","Chennai",10,5],
                ["Kolkata Knight Riders","Kolkata",20,10],
                ["Mumbai Indians","Mumbai",12,10],
                ["Rajasthan Royals","Jaipur",24,15]
            ],
        columns=["Team","City","Wins","Loss"]
        )

cities = pd.DataFrame(
            [
                ["Kolkata","Bengal",85000000],
                ["Bangalore","Karnataka",5450000],
                ["Jaipur","Rajasthan",43080000],
                ["Mumbai","Maharashtra",15000000]
            ],
        columns=["City","State","Population"]
        )

In [40]:
teams

                    Team     City  Wins  Loss
0    Chennai Super Kings  Chennai    10     5
1  Kolkata Knight Riders  Kolkata    20    10
2         Mumbai Indians   Mumbai    12    10
3       Rajasthan Royals   Jaipur    24    15

In [41]:
cities

        City        State  Population
0    Kolkata       Bengal    85000000
1  Bangalore    Karnataka     5450000
2     Jaipur    Rajasthan    43080000
3     Mumbai  Maharashtra    15000000

In [42]:
# Now we merge
teams.merge(cities)
# It merged on 'city' columns as it's present in both table
# In merge() the default join is 'inner-join'

                    Team     City  Wins  Loss        State  Population
0  Kolkata Knight Riders  Kolkata    20    10       Bengal    85000000
1         Mumbai Indians   Mumbai    12    10  Maharashtra    15000000
2       Rajasthan Royals   Jaipur    24    15    Rajasthan    43080000

In [43]:
cities.merge(teams)

      City        State  Population                   Team  Wins  Loss
0  Kolkata       Bengal    85000000  Kolkata Knight Riders    20    10
1   Jaipur    Rajasthan    43080000       Rajasthan Royals    24    15
2   Mumbai  Maharashtra    15000000         Mumbai Indians    12    10

> In case two dataframes have two common columns.
> We can decide based on which column we want to merge
> syntax: df1.merge(df2,on="col-name")

In [44]:
# Right Join & Left Join, we use how=
teams.merge(cities,how="left")

                    Team     City  Wins  Loss        State  Population
0    Chennai Super Kings  Chennai    10     5          NaN         NaN
1  Kolkata Knight Riders  Kolkata    20    10       Bengal  85000000.0
2         Mumbai Indians   Mumbai    12    10  Maharashtra  15000000.0
3       Rajasthan Royals   Jaipur    24    15    Rajasthan  43080000.0

## Merge() 'on' and suffix arguments